warbler12/FOC_Motor_Control/mcb/FOCI2CExample/mcb_pmsm_foc_I2C_f28379d_origin_ert_rtw/mcb_pmsm_foc_I2C_f28379d_origin.h
/* Block states (default storage) for system '<Root>' */
typedef struct {
  volatile real_T RT12_Buffer[2];      /* '<Root>/RT12' */
  real32_T UnitDelay_DSTATE;           /* '<S191>/Unit Delay' */
  real32_T Integrator_DSTATE;          /* '<S139>/Integrator' */
  real32_T Integrator_DSTATE_o;        /* '<S88>/Integrator' */
  real32_T Delay_DSTATE;               /* '<S181>/Delay' */
  real32_T UnitDelay_DSTATE_l;         /* '<S18>/Unit Delay' */
  real32_T UnitDelay1_DSTATE;          /* '<S18>/Unit Delay1' */
  uint32_T Delay_DSTATE_p[20];         /* '<S185>/Delay' */
  volatile real32_T RT1_Buffer[2];     /* '<Root>/RT1' */
  volatile real32_T RT3_Buffer[2];     /* '<Root>/RT3' */
  volatile real32_T RT2_Buffer[4];     /* '<Root>/RT2' */
  volatile real32_T RT4_Buffer[2];     /* '<Root>/RT4' */
  volatile real32_T RT8_Buffer0;       /* '<Root>/RT8' */
  volatile real32_T RT9_Buffer0;       /* '<Root>/RT9' */
  real32_T SpeedRef;                   /* '<Root>/Data Store Memory4' */
  real32_T PosRef;                     /* '<Root>/Data Store Memory5' */
  volatile real32_T RT10_Buffer[4];    /* '<Root>/RT10' */
  volatile real32_T RT11_Buffer[4];    /* '<Root>/RT11' */
  real32_T Unwrap_Prev;                /* '<S181>/Unwrap' */
  real32_T Unwrap_Cumsum;              /* '<S181>/Unwrap' */
  int32_T DigitalOutput_FRAC_LEN;      /* '<S237>/Digital Output' */
  int32_T DigitalOutput_FRAC_LEN_e;    /* '<S227>/Digital Output' */
  int32_T DigitalOutput1_FRAC_LEN;     /* '<S227>/Digital Output1' */
  int32_T SpeedCount_DWORK1;           /* '<S185>/SpeedCount' */
  int32_T Add_DWORK1[2];               /* '<S182>/Add' */
  int32_T DRV830xEnable_FRAC_LEN;      /* '<S204>/DRV830x Enable' */
  uint32_T Sum_DWORK1[4];              /* '<S166>/Sum' */
  uint32_T Add_DWORK1_n;               /* '<S209>/Add' */
  int_T CANPack_ModeSignalID;          /* '<S20>/CAN Pack' */
  int_T CANUnpack_ModeSignalID;        /* '<S17>/CAN Unpack' */
  int_T CANUnpack_StatusPortID;        /* '<S17>/CAN Unpack' */
  uint16_T Output_DSTATE;              /* '<S211>/Output' */
  volatile int16_T RT1_ActiveBufIdx;   /* '<Root>/RT1' */
  volatile int16_T RT1_semaphoreTaken; /* '<Root>/RT1' */
  volatile int16_T RT3_ActiveBufIdx;   /* '<Root>/RT3' */
  volatile int16_T RT2_ActiveBufIdx;   /* '<Root>/RT2' */
  volatile int16_T RT4_ActiveBufIdx;   /* '<Root>/RT4' */
  volatile int16_T RT8_semaphoreTaken; /* '<Root>/RT8' */
  volatile int16_T RT9_semaphoreTaken; /* '<Root>/RT9' */
  volatile int16_T RT10_ActiveBufIdx;  /* '<Root>/RT10' */
  volatile int16_T RT10_semaphoreTaken;/* '<Root>/RT10' */
  volatile int16_T RT11_ActiveBufIdx;  /* '<Root>/RT11' */
  volatile int16_T RT11_semaphoreTaken;/* '<Root>/RT11' */
  volatile int16_T RT12_ActiveBufIdx;  /* '<Root>/RT12' */
  uint16_T IaOffset;                   /* '<Root>/Data Store Memory1' */
  uint16_T IbOffset;                   /* '<Root>/Data Store Memory2' */
  uint16_T Debug_signals;              /* '<Root>/Data Store Memory6' */
  uint16_T Control_Mode;               /* '<Root>/Data Store Memory7' */
  uint16_T CircBufIdx;                 /* '<S185>/Delay' */
  boolean_T UnitDelay_DSTATE_f;        /* '<S1>/Unit Delay' */
  int16_T Integrator_PrevResetState;   /* '<S139>/Integrator' */
  int16_T Integrator_PrevResetState_k; /* '<S88>/Integrator' */
  boolean_T Enable;                    /* '<Root>/Data Store Memory29' */
  boolean_T Enable_I2C;                /* '<Root>/Data Store Memory3' */
  boolean_T ERR;                       /* '<Root>/Data Store Memory8' */
  boolean_T Unwrap_FirstStep;          /* '<S181>/Unwrap' */
  DW_SpeedControl_mcb_pmsm_foc__T SpeedControl;/* '<Root>/Speed Control' */
  DW_SPIMasterTransfer_mcb_pmsm_T SPIMasterTransfer1;/* '<S235>/SPI Master Transfer' */
  DW_SPIMasterTransfer_mcb_pmsm_T SPIMasterTransfer;/* '<S235>/SPI Master Transfer' */
} DW_mcb_pmsm_foc_I2C_f28379d_o_T;

/* Invariant block signals (default storage) */
typedef struct {
  const uint32_T Width;                /* '<S208>/Width' */
  const uint16_T DataTypeConversion;   /* '<S20>/Data Type Conversion' */
  const uint16_T DataTypeConversion5;  /* '<S20>/Data Type Conversion5' */
  const uint16_T DataTypeConversion6;  /* '<S20>/Data Type Conversion6' */
  const boolean_T CastToBoolean;       /* '<S19>/Cast To Boolean' */
} ConstB_mcb_pmsm_foc_I2C_f2837_T;

/* Constant parameters (default storage) */
typedef struct {
  /* Pooled Parameter (Expression: )
   * Referenced by:
   *   '<S156>/sine_table_values'
   *   '<S166>/sine_table_values'
   */
  real32_T pooled11[1002];
} ConstP_mcb_pmsm_foc_I2C_f2837_T;

/* Real-time Model Data Structure */
struct tag_RTM_mcb_pmsm_foc_I2C_f283_T {
  const char_T * volatile errorStatus;

  /*
   * Timing:
   * The following substructure contains information regarding
   * the timing information for the model.
   */
  struct {
    struct {
      uint16_T TID[6];
    } TaskCounters;
  } Timing;
};

extern CAN_DATATYPE CAN_DATATYPE_GROUND;
extern CAN_DATATYPE CAN_DATATYPE_GROUND;
extern CAN_DATATYPE CAN_DATATYPE_GROUND;

/* Block signals (default storage) */
extern B_mcb_pmsm_foc_I2C_f28379d_or_T mcb_pmsm_foc_I2C_f28379d_orig_B;

/* Block states (default storage) */
extern DW_mcb_pmsm_foc_I2C_f28379d_o_T mcb_pmsm_foc_I2C_f28379d_ori_DW;
extern const ConstB_mcb_pmsm_foc_I2C_f2837_T mcb_pmsm_foc_I2C_f28379d_ConstB;/* constant block i/o */

/* Constant parameters (default storage) */
extern const ConstP_mcb_pmsm_foc_I2C_f2837_T mcb_pmsm_foc_I2C_f28379d_ConstP;

/* External function called from main */
extern void mcb_pmsm_foc_I2C_f28379d_origin_SetEventsForThisBaseStep(boolean_T
  *eventFlags);

/* Model entry point functions */
extern void mcb_pmsm_foc_I2C_f28379d_origin_initialize(void);
extern void mcb_pmsm_foc_I2C_f28379d_origin_step0(void);
extern void mcb_pmsm_foc_I2C_f28379d_origin_step1(void);
extern void mcb_pmsm_foc_I2C_f28379d_origin_step2(void);
extern void mcb_pmsm_foc_I2C_f28379d_origin_step3(void);
extern void mcb_pmsm_foc_I2C_f28379d_origin_step4(void);
extern void mcb_pmsm_foc_I2C_f28379d_origin_step5(void);
extern void mcb_pmsm_foc_I2C_f28379d_origin_terminate(void);

