warbler12/FOC_Motor_Control/mcb/FOCI2CExample/mcb_pmsm_foc_I2C_f28379d_origin_ert_rtw/mcb_pmsm_foc_I2C_f28379d_origin.h
 * '<S150>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Tracking Mode/Disabled'
 * '<S151>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum/Passthrough'
 * '<S152>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral/TsSignalSpecification'
 * '<S153>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain/Passthrough'
 * '<S154>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/postSat Signal/Forward_Path'
 * '<S155>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Control_System/Current_Controllers/PI_Controller_Iq/Discrete PI Controller  with anti-windup & reset/preSat Signal/Forward_Path'
 * '<S156>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Control_System/Inverse Park Transform/Sine Cosine'
 * '<S157>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Control_System/Inverse Park Transform/Two inputs CRL'
 * '<S158>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Control_System/Inverse Park Transform/Sine Cosine/Interpolation'
 * '<S159>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Control_System/Inverse Park Transform/Sine Cosine/WrapUp'
 * '<S160>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Control_System/Inverse Park Transform/Sine Cosine/WrapUp/Compare To Zero'
 * '<S161>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Control_System/Inverse Park Transform/Sine Cosine/WrapUp/If Action Subsystem'
 * '<S162>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Control_System/Inverse Park Transform/Sine Cosine/WrapUp/If Action Subsystem1'
 * '<S163>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Control_System/Inverse Park Transform/Two inputs CRL/Switch_Axis'
 * '<S164>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Control_System/Park Transform/Sine Cosine'
 * '<S165>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Control_System/Park Transform/Two inputs CRL'
 * '<S166>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Control_System/Park Transform/Sine Cosine/Sine-Cosine Lookup'
 * '<S167>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Control_System/Park Transform/Sine Cosine/Sine-Cosine Lookup/Interpolation'
 * '<S168>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Control_System/Park Transform/Sine Cosine/Sine-Cosine Lookup/WrapUp'
 * '<S169>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Control_System/Park Transform/Sine Cosine/Sine-Cosine Lookup/WrapUp/Compare To Zero'
 * '<S170>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Control_System/Park Transform/Sine Cosine/Sine-Cosine Lookup/WrapUp/If Action Subsystem'
 * '<S171>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Control_System/Park Transform/Sine Cosine/Sine-Cosine Lookup/WrapUp/If Action Subsystem1'
 * '<S172>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Control_System/Park Transform/Two inputs CRL/Switch_Axis'
 * '<S173>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Control_System/Space Vector Generator/Modulation method'
 * '<S174>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Control_System/Space Vector Generator/Voltage Input'
 * '<S175>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Control_System/Space Vector Generator/Modulation method/SVPWM'
 * '<S176>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Control_System/Space Vector Generator/Modulation method/SVPWM/Half(Vmin+Vmax)'
 * '<S177>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Control_System/Space Vector Generator/Voltage Input/Valphabeta'
 * '<S178>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Control_System/Space Vector Generator/Voltage Input/Valphabeta/Inverse Clarke Transform'
 * '<S179>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Control_System/Space Vector Generator/Voltage Input/Valphabeta/Inverse Clarke Transform/Two phase input'
 * '<S180>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/HW_Inputs/Sensor Driver Blocks (codegen)'
 * '<S181>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Input Scaling/ Calculate Position and Speed'
 * '<S182>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Input Scaling/Calculate Phase Currents'
 * '<S183>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Input Scaling/ Calculate Position and Speed/IIR Filter'
 * '<S184>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Input Scaling/ Calculate Position and Speed/Mechanical to Electrical Position'
 * '<S185>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Input Scaling/ Calculate Position and Speed/Speed Measurement'
 * '<S186>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Input Scaling/ Calculate Position and Speed/Subsystem'
 * '<S187>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Input Scaling/ Calculate Position and Speed/Subsystem1'
 * '<S188>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Input Scaling/ Calculate Position and Speed/Subsystem2'
 * '<S189>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Input Scaling/ Calculate Position and Speed/IIR Filter/IIR Filter'
 * '<S190>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Input Scaling/ Calculate Position and Speed/IIR Filter/IIR Filter/Low-pass'
 * '<S191>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Input Scaling/ Calculate Position and Speed/IIR Filter/IIR Filter/Low-pass/IIR Low Pass Filter'
 * '<S192>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Input Scaling/ Calculate Position and Speed/Mechanical to Electrical Position/MechToElec'
 * '<S193>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Input Scaling/ Calculate Position and Speed/Mechanical to Electrical Position/MechToElec/floating-point'
 * '<S194>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Input Scaling/ Calculate Position and Speed/Mechanical to Electrical Position/MechToElec/floating-point/Compensate Offset'
 * '<S195>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Input Scaling/ Calculate Position and Speed/Mechanical to Electrical Position/MechToElec/floating-point/Mech To Elec'
 * '<S196>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Input Scaling/ Calculate Position and Speed/Mechanical to Electrical Position/MechToElec/floating-point/Compensate Offset/If Action Subsystem'
 * '<S197>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Input Scaling/ Calculate Position and Speed/Mechanical to Electrical Position/MechToElec/floating-point/Compensate Offset/If Action Subsystem1'
 * '<S198>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Input Scaling/ Calculate Position and Speed/Mechanical to Electrical Position/MechToElec/floating-point/Mech To Elec/Variant Subsystem'
 * '<S199>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Input Scaling/ Calculate Position and Speed/Mechanical to Electrical Position/MechToElec/floating-point/Mech To Elec/Variant Subsystem/Dialog'
 * '<S200>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Input Scaling/ Calculate Position and Speed/Speed Measurement/DT_Handle'
 * '<S201>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Input Scaling/ Calculate Position and Speed/Speed Measurement/DT_Handle/floating-point'
 * '<S202>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Input Scaling/Calculate Phase Currents/Data_Type'
 * '<S203>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Input Scaling/Calculate Phase Currents/Data_Type/Data_Type_Float'
 * '<S204>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Inverter/Code Generation'
 * '<S205>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/Pos_selection/Sensor Driver Blocks (codegen)'
 * '<S206>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/SCI_Tx/Code Generation'
 * '<S207>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/SCI_Tx/Code Generation/Data_Conditioning_Tx'
 * '<S208>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/SCI_Tx/Code Generation/Data_Logging'
 * '<S209>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/SCI_Tx/Code Generation/While Iterator Subsystem'
 * '<S210>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/SCI_Tx/Code Generation/Data_Conditioning_Tx/Data_Type_Float'
 * '<S211>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/SCI_Tx/Code Generation/Data_Logging/Counter Limited'
 * '<S212>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/SCI_Tx/Code Generation/Data_Logging/Data'
 * '<S213>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/SCI_Tx/Code Generation/Data_Logging/End'
 * '<S214>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/SCI_Tx/Code Generation/Data_Logging/Start'
 * '<S215>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/SCI_Tx/Code Generation/Data_Logging/Counter Limited/Increment Real World'
 * '<S216>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Current Control/SCI_Tx/Code Generation/Data_Logging/Counter Limited/Wrap To Zero'
 * '<S217>' : 'mcb_pmsm_foc_I2C_f28379d_origin/HW Interrupt/Code generation'
 * '<S218>' : 'mcb_pmsm_foc_I2C_f28379d_origin/HW Interrupt/Code generation/HWI_ADCB1_INT'
 * '<S219>' : 'mcb_pmsm_foc_I2C_f28379d_origin/HW Interrupt/Code generation/HWI_SCIA_RX_INT'
 * '<S220>' : 'mcb_pmsm_foc_I2C_f28379d_origin/HW Interrupt/Code generation/HWI_ADCB1_INT/ECSoC'
 * '<S221>' : 'mcb_pmsm_foc_I2C_f28379d_origin/HW Interrupt/Code generation/HWI_ADCB1_INT/ECSoC/ECSimCodegen'
 * '<S222>' : 'mcb_pmsm_foc_I2C_f28379d_origin/HW Interrupt/Code generation/HWI_SCIA_RX_INT/ECSoC'
 * '<S223>' : 'mcb_pmsm_foc_I2C_f28379d_origin/HW Interrupt/Code generation/HWI_SCIA_RX_INT/ECSoC/ECSimCodegen'
 * '<S224>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Hardware Init/Variant Subsystem'
 * '<S225>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Hardware Init/Variant Subsystem/Code Generation'
 * '<S226>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Hardware Init/Variant Subsystem/Code Generation/Calculate ADC Offset '
 * '<S227>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Hardware Init/Variant Subsystem/Code Generation/DRV Enable'
 * '<S228>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Hardware Init/Variant Subsystem/Code Generation/Default ADC Offset'
 * '<S229>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Hardware Init/Variant Subsystem/Code Generation/Calculate ADC Offset /For Iterator Subsystem'
 * '<S230>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Hardware Init/Variant Subsystem/Code Generation/Calculate ADC Offset /If Action Subsystem'
 * '<S231>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Hardware Init/Variant Subsystem/Code Generation/Calculate ADC Offset /If Action Subsystem1'
 * '<S232>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Hardware Init/Variant Subsystem/Code Generation/Calculate ADC Offset /If Action Subsystem2'
 * '<S233>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Hardware Init/Variant Subsystem/Code Generation/Calculate ADC Offset /If Action Subsystem3'
 * '<S234>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Hardware Init/Variant Subsystem/Code Generation/Calculate ADC Offset /For Iterator Subsystem/If Action Subsystem'
 * '<S235>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Hardware Init/Variant Subsystem/Code Generation/DRV Enable/ADC Gain setting'
 * '<S236>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Heartbeat LED/Heartbeat LED'
 * '<S237>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Heartbeat LED/Heartbeat LED/Code generation'
 * '<S238>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Inverter and Motor - Plant Model/Codegeneration'
 * '<S239>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Serial Receive/Data_Conditioning_Rx'
 * '<S240>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Serial Receive/SCI_Rx'
 * '<S241>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Serial Receive/unParse'
 * '<S242>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Serial Receive/Data_Conditioning_Rx/Data_Type_Float'
 * '<S243>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Serial Receive/SCI_Rx/Code Generation'
 * '<S244>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Serial Receive/SCI_Rx/Code Generation/Data_Type_Float'
 * '<S245>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed'
 * '<S246>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/Speed_Ref_Selector'
 * '<S247>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset'
 * '<S248>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Zero_Cancellation'
 * '<S249>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Anti-windup'
 * '<S250>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/D Gain'
 * '<S251>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Filter'
 * '<S252>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Filter ICs'
 * '<S253>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/I Gain'
 * '<S254>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Ideal P Gain'
 * '<S255>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk'
 * '<S256>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Integrator'
 * '<S257>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Integrator ICs'
 * '<S258>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/N Copy'
 * '<S259>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/N Gain'
 * '<S260>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/P Copy'
 * '<S261>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Parallel P Gain'
 * '<S262>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Reset Signal'
 * '<S263>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Saturation'
 * '<S264>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk'
 * '<S265>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Sum'
 * '<S266>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Sum Fdbk'
 * '<S267>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tracking Mode'
 * '<S268>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum'
 * '<S269>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral'
 * '<S270>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain'
 * '<S271>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/postSat Signal'
 * '<S272>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/preSat Signal'
 * '<S273>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel'
 * '<S274>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone'
 * '<S275>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone/Enabled'
 * '<S276>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/D Gain/Disabled'
 * '<S277>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Filter/Disabled'
 * '<S278>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Filter ICs/Disabled'
 * '<S279>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/I Gain/External Parameters'
 * '<S280>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Ideal P Gain/Passthrough'
 * '<S281>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk/Disabled'
 * '<S282>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Integrator/Discrete'
 * '<S283>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Integrator ICs/External IC'
 * '<S284>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/N Copy/Disabled wSignal Specification'
 * '<S285>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/N Gain/Disabled'
 * '<S286>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/P Copy/Disabled'
 * '<S287>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Parallel P Gain/External Parameters'
 * '<S288>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Reset Signal/External Reset'
 * '<S289>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Saturation/Enabled'
 * '<S290>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk/Disabled'
 * '<S291>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Sum/Sum_PI'
 * '<S292>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Sum Fdbk/Disabled'
 * '<S293>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tracking Mode/Disabled'
 * '<S294>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum/Passthrough'
 * '<S295>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral/TsSignalSpecification'
 * '<S296>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain/Passthrough'
 * '<S297>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/postSat Signal/Forward_Path'
 * '<S298>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/preSat Signal/Forward_Path'
 * '<S299>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Zero_Cancellation/IIR Filter'
 * '<S300>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Zero_Cancellation/IIR Filter/Low-pass'
 * '<S301>' : 'mcb_pmsm_foc_I2C_f28379d_origin/Speed Control/PI_Controller_Speed/Zero_Cancellation/IIR Filter/Low-pass/IIR Low Pass Filter'
 */
#endif                       /* RTW_HEADER_mcb_pmsm_foc_I2C_f28379d_origin_h_ */

/*
 * File trailer for generated code.
 *
 * [EOF]
 */
